9/data/attachments/ca3499e8e2a1cff9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_fab22856-611d-4f4b-9475-f7710b7ccd0a</nif:username>
            <nif:friendToBeAdded>Edward_friend_Friend_15915_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>